

<style>
    .spacetab {
        padding-left: 3em;
    }
</style>
<div class="container" style="margin-top: 3%">
    <h4 align="center">ข้อปฏิบัติสำหรับการลงทะเบียนสมัครเป็นตัวแทนจำหน่ายสินค้าทุกประเภท</h4>
    <h5 align="center">ของ Alive Dropship</h5>
    <p style="text-align: center">ในเว็บไซต์ ระบบ <span style="font-size: 20px">Alive Dropship</span><br/>
        อันเป็นการทำสัญญาและธุรกรรมทางอิเล็กทรอนิกส์<br/>
        ตามกฎหมายว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์<br/><br/></p>
    <h5>ส่วนของผู้สมัคร (ผู้ตกลงทำสัญญา) </h5>
    <h5>ให้มีข้อมูลดังต่อไปนี้ในระบบ</h5>
    <p style="font-size: 16px">
        1. ชื่อตัวและชื่อสกุลจริงที่สะกดตัวอักษรและสระอย่างถูกต้องของผู้สมัคร<br/>
        2. หมายเลขโทรศัพท์มือถือ, Line ID หรือชื่อบัญชีผู้ใช้ Line ของผู้สมัคร<br/>
        3. ชื่อร้านค้าของผู้สมัครและที่อยู่ของผู้สมัคร (ซึ่งที่อยู่นี้จะถูกใช้เป็นที่อยู่ผู้ส่ง)<br/>
        4. Facebook URL, Instagram และ E-mail ของผู้สมัคร<br/>
        5. เลขที่บัตรประจำตัวประชาชนของผู้สมัคร<br/><br/></p>

    <h5 style="text-align: center">ส่วนของเงื่อนไขและข้อสัญญาที่ให้ผู้จัดทำระบบใส่ลงไว้ในระบบ<br/>
        ได้แก่ ข้อความในกรอบด้านล่าง ดังต่อไปนี้</h5><br/>
    <p style="text-align: center"> สัญญาตั้งตัวแทนจำหน่ายสินค้า</p><br/>

    <p>

        1. ข้าพเจ้าตกลงสมัครเข้าทำสัญญาเป็นตัวแทนจำหน่ายสินค้าของ Alive Dropship ในนามของบริษัท นาคานารา จำกัด
        ดังปรากฏตามข้อมูลของข้าพเจ้าที่ได้ลงทะเบียนในระบบ<br/>
        2. สัญญานี้เป็นสัญญาตั้งตัวแทนจำหน่ายสินค้าระหว่างข้าพเจ้า กับ Alive Dropship ในนามของบริษัท นาคานารา จำกัด<br/>
        3. ต่อไปในสัญญานี้จะเรียกข้าพเจ้าว่า "ตัวแทนจำหน่าย" และเรียก Alive Dropship ในนามของบริษัท นาคานารา จำกัด ว่า
        "บริษัท"<br/>
        4. บริษัทตกลงแต่งตั้งโดยให้สิทธิตัวแทนจำหน่ายให้จำหน่ายสินค้าทุกชนิดและทุกประเภทของบริษัท อันได้แก่
        ผลิตภัณฑ์เสริมอาหาร, ผลิตภัณฑ์เกี่ยวกับการดูแล บำรุง และรักษาสุขภาพ ตลอดจนถึงผลิตภัณฑ์ต่าง ๆ ของบริษัท เป็นต้น
        ดังมีรายละเอียดของสินค้า จำนวน ราคา ส่วนลด โปรโมชั่น สิทธิประโยชน์ รางวัล กำหนดวันนัดรับ
        รวมทั้งรายละเอียดที่เกี่ยวข้องอื่นใดที่ปรากฎในเอกสาร แผ่นพับโฆษณา สื่อโฆษณา
        และหรือตามที่ปรากฎในเอกสารโมษณาหรือประชาสัมพันธ์สินค้า หรือที่ปรากฎทางอินเทอร์เน็ตเว็บไซต์
        หรือทางโชเชียลมีเดียอื่นใด, หรือที่ปรากฏในใบสั่งซื้อ ใบจอง ใบวางเงินมัดจำ ใบวางบิล/ใบแจ้งหนี้ ใบส่งสินค้า
        ใบรับสินค้า ข้อมูลคอมพิวเตอร์ ข้อมูลอิเล็กทรอนิกส์
        ตลอดจนเอกสารหลักฐานอื่นใดทั้งหมดที่แสดงถึงการซื้อขายสินค้าของบริษัทระหว่างบริษัทกับตัวแทนจำหน่ายในทุกครั้ง
        ทั้งในวันทำสัญญาฉบับนี้หรือที่จะมีขึ้นในภายหน้าตลอดอายุสัญญา
        ซึ่งต่อไปในสัญญานี้จะเรียกสินค้าทุกชนิดและทุกประเภทของบริษัท อันได้แก่ ผลิตภัณฑ์เสริมอาหาร,
        ผลิตภัณฑ์เกี่ยวกับการดูแล บำรุง และผลิตภัณฑ์ต่าง ๆ ของบริษัท เป็นต้น ตามที่กล่าวมาข้างต้นว่า "สินค้า"
        และให้ถือเอกสารหลักฐานและข้อมูลดังกล่าวทั้งหมดเป็นส่วนหนึ่งของสัญญานี้ด้วย<br/>
        5. บริษัทให้สิทธิแก่ตัวแทนจำหน่ายในการสั่งซื้อสินค้าในราคาที่กำหนด โดยให้สิทธิเป็นตัวแทนจำหน่ายสินค้าของบริษัท
        มีกำหนดระยะเวลาตามที่ตกลงกัน<br/>
        6. ตัวแทนจำหน่ายตกลงรับสิทธิในการจำหน่ายสินค้าของบริษัทดังกล่าวข้างต้น
        โดยจะกระทำการเป็นตัวแทนจำหน่ายด้วยความสุจริต
        จะสนับสนุนและส่งเสริมสินค้าของบริษัทให้เป็นที่นิยมแพร่หลายด้วยวิธีการอันถูกต้องตามกฎหมายและเหมาะสม
        และรับรองว่าจะไม่ทำการอย่างหนึ่งอย่างใดให้เป็นที่เสื่อมเสียหรือกระทบกระเทือนในทางที่เสียหายต่อภาพลักษณ์
        ชื่อเสียง เกียรติคุณ ธุรกิจ กิจการ ทางทำมาหาได้ หรือการจำหน่ายสินค้าของบริษัท กรรมการ ผู้บริหาร พนักงาน ลูกจ้าง
        หุ้นส่วน รวมถึงตัวแทนจำหน่ายคนอื่น ๆ<br/>
        7. ในการสั่งซื้อสินค้า ตัวแทนจำหน่ายจะวางเงินมัดจำให้แก่บริษัทในวันสั่งซื้อสินค้าหรือวันทำสัญญา
        โดยจะต้องยื่นใบสั่งซื้อ (ใบ PO (Purchase Oder)) ต่อบริษัทพร้อมกับชำระเงินมัดจำ หรือโดยวิธีอื่นใดในการ ทั้งนี้
        ตามระเบียบและเงื่อนไขที่บริษัทกำหนด หรือตามที่ได้เผยแพร่หรือประกาศลงในเว็บไซต์ของบริษัท<br/>
        8. เงินมัดจำ ค่าจองสิทธิ หรือเงินอื่นใดที่ตัวแทนจำหน่ายได้จ่ายให้แก่บริษัทในการสมัครทำสัญญา
        ให้ถือเป็นหลักฐานการสั่งซื้อสินค้าและเป็นหลักประกันในการปฏิบัติตามสัญญาด้วย<br/>
        9. ตัวแทนจำหน่ายจะชำระราคาสินค้าให้แก่บริษัทตามระเบียบและเงื่อนไขที่บริษัทกำหนด
        หรือตามที่ได้เผยแพร่หรือประกาศลงในเว็บไซต์ของบริษัท หรือตามการแจ้งในช่องทางอื่นใด<br/>
        10. บริษัทจะส่งมอบสินค้าให้แก่ตัวแทนจำหน่ายภายในกำหนดที่ตกลงกัน
        นับแต่วันที่ตัวแทนจำหน่ายได้ชำระราคาสินค้าครบถ้วนให้แก่บริษัทแล้ว<br/>
        11. บริษัทจะส่งมอบสินค้าให้แก่ตัวแทนจำหน่ายตามวิธีการและเงื่อนไขที่บริษัทกำหนด
        หรือตามที่ได้เผยแพร่หรือประกาศลงในเว็บไซต์ของบริษัท<br/>
        12. ในกรณีที่มีเหตุขัดข้อง เหตุจำเป็นอันมิอาจก้าวล่วงได้ เหตุสุดวิสัย
        หรือเหตุอื่นใดอันทำให้บริษัทไม่สามารถผลิตสินค้าได้ทันโดยมีหตุผลอันสมควร
        ตัวแทนจำหน่ายตกลงให้บริษัทส่งมอบสินค้าบางส่วนเท่าที่มีก่อนได้
        และตกลงให้บริษัทสามารถขยายเวลาการส่งมอบสินค้าได้ภายในเวลาที่สมควรแก่ความจำเป็นเพื่อการผลิตสินค้าหรือเพื่อบำบัดข้อขัดข้อง
        หรือจนกว่าเหตุสุดวิสัยจะสิ้นสุดลงแล้ว โดยแจ้งให้ตัวแทนจำหน่ายทราบ<br/>
        13. เมื่อได้ทำสัญญานี้แล้วก็ดี ตัวแทนจำหน่ายได้ซื้อหรือรับสินค้าไปจากบริษัทแล้วก็ดี
        ตัวแทนจำหน่ายจะไม่ขายสินค้าคืนบริษัท และบริษัทจะไม่รับซื้อคืนสินค้าจากตัวแทนจำหน่ายไม่ว่าในกรณีใด<br/>
        14. กรณีที่ตัวแทนจำหน่ายชำระเงินสินค้าเกินเวลาที่กำหนดก็ดี ไม่ชำระเงินค่าสินค้าไม่ว่าทั้งหมดหรือแต่บางส่วนก็ดี
        เป็นเหตุให้บริษัทได้รับความเสียหาย ตัวแทนจำหน่ายตกลงเสียดอกเบี้ยให้แก่บริษัทในอัตราร้อยละ 15 ต่อปี
        ของเงินค่าสินค้าที่ค้างชำระหรือที่มิได้ชำระ และยินยอมให้บริษัทริบเงินมัดจำที่วางไว้ได้ทันที (หากมี)
        และไม่เป็นการตัดสิทธิในการที่บริษัทจะบอกเลิกสัญญา<br/>
        15. กรณีสินค้าที่ส่งมอบมีจำนวนไม่ครบถ้วนก็ดี มีความชำรุดบกพร่องก็ดี
        หรือมีข้อโต้แย้งอื่นใดเกี่ยวกับสินค้าที่รับมอบก็ดี โดยมิใช่เป็นการขายคืนสินค้า
        ตัวแทนจำหน่ายต้องแจ้งเหตุดังกล่าวเป็นลายลักษณ์อักษรต่อบริษัทพร้อมกับแสดงหลักฐานอันน่าเชื่อถือภายในกำหนด 7 วัน
        (เจ็ดวัน) นับแต่วันที่ได้รับมอบสินค้าเพื่อให้บริษัทพิจารณา หากบริษัทพิจารณาแล้วเห็นว่ามีเหตุดังกล่าวจริง
        ก็จะส่งมอบสินค้าส่วนที่ขาดให้ครบถ้วน เปลี่ยนสินค้าใหม่ให้
        หรือกระทำการอื่นใดในทางที่เป็นธรรมและเหมาะสมตามสมควรเกี่ยวกับเหตุดังกล่าว,
        หากตัวแทนจำหน่ายไม่แจ้งเหตุดังกล่าวภายในเวลาที่กำหนด ให้ถือว่าตัวแทนจำหน่ายได้รับสินค้าครบถ้วน
        โดยสินค้าไม่ชำรุดบกพร่อง และตัวแทนจำหน่ายจะไม่โต้แย้งใดใดเกี่ยวกับสินค้าดังกล่าวอีก<br/>
        16. เพื่อความเป็นธรรมและใส่ใจต่อผู้บริโภค และเพื่อให้มีหลักธรรมาภิบาลในการประกอบธุรกิจ
        อันเป็นนโยบายสำคัญของบริษัท ตัวแทนจำหน่ายตกลงปฏิบัติดังจะกล่าวต่อไปนี้<br/>
    <div class="spacetab">
        16.1 ตัวแทนจำหน่ายจะไม่บรรยายหรือโอ้อวดสรรพคุณของสินค้าเกินกว่าที่เป็นจริง<br/>
        16.2 ตัวแทนจำหน่ายจะจำหน่ายสินค้าตามราคาที่บริษัทเป็นผู้แจ้งและกำหนดให้ทราบตามระเบียบและเงื่อนไขที่บริษัทกำหนด
        หรือตามที่ได้เผยแพร่หรือประกาศลงในเว็บไซต์ของบริษัท หรือตามการแจ้งในช่องทางอื่นใด
        ไม่ว่าจะเป็นการขายส่งหรือขายปลีก<br/>
        16.3 ตัวแทนจำหน่ายจะไม่จำหน่ายสินค้าในราคาที่ต่ำกว่าหรือแตกต่างไปจากราคาที่บริษัทกำหนด (ขายตัดราคา)
        ไม่ว่าในกรณีใด ๆ ทั้งสิ้น เว้นแต่ได้รับอนุญาตหรือความยินยอมเป็นหนังสือโดยขัดแจ้งจากบริษัทแล้ว
        หากตัวแทนจำหน่ายฝ่าฝืนโดยจำหน่ายสินค้าในราคาที่ต่ำกว่าหรือแตกต่างไปจากราคาที่บริษัทกำหนด
        ตัวแทนจำหน่ายตกลงยินยอมให้บริษัทปรับเป็นเงินจำนวน 300,000 บาท (สามแสนบาทถ้วน)
        ต่อครั้งที่ได้มีการฝ่าฝืนสัญญาข้อนี้ หรือต่อครั้งที่ได้ขายสินค้าตัดราคา<br/>
        16.4
        ตัวแทนจำหน่ายจะไม่จัดรายการหรือกิจกรรมส่งเสริมการขายอื่นใดที่เป็นการขายสินค้าในราคาต่ำกว่าราคาที่บริษัทกำหนด
        (จัดรายการลดราคาสินค้าหรือจัดโปรโมชั่น)<br/>
        16.5 ตัวแทนจำหน่ายมีหน้าที่ต้องป้องกันและควบคุมดูแล โดยสัญญาว่าจะป้องกันและควบคุมดูแลให้ผู้จัดจำหน่าย (ลูกทีม),
        คู่ค้า, หรือบุคคลอื่นใดซึ่งซื้อหรือรับสินค้าไปจากตัวแทนจำหน่ายก็ดี รับไปจากผู้จัดจำหน่าย (ลูกทีม) ของตนก็ดี
        หรือรับไปจกบุคคลใดบุคคลหนึ่งสืบทอดต่อ ๆ กันมาก็ดี, ให้บุคคลเหล่านั้นขายสินค้าตามที่บริษัทกำหนดเท่านั้น
        ไม่ให้บุคคลดังกล่าวขายสินค้าตัดราคาตัวแทนจำหน่ายทราบดีว่าการขายต่ำกว่าราคาที่บริษัทกำหนดให้ขายได้นั้น
        เป็นการขายตัดราคา<br/>
        16.6 ตัวแทนจำหน่ายจะควบคุมดูแลอย่างเคร่งครัดไม่ให้บุคคลดังกล่าวในข้อ 16.5
        หรือบุคคลอื่นใดขายสินค้าตัดราคากับตัวแทนจำหน่ายและผู้จัดจำหน่ายคนอื่น ๆ ไม่ว่าในกรณีใด ๆ
        ไม่ว่าจะเป็นการขายในรูปแบบ ประเภท วิธีการ หรือลักษณะใดหรือเป็นการขายในช่องทางใด
        ไม่ว่าเป็นการขายสินค้าผ่านทางเว็บไซต์หรือโซเซียลมีเดียอื่นใดที่เป็นสื่อกลางการติดต่อซื้อขายสินค้า
        ตัวแทนจำหน่ายก็จะป้องกันและควบคุมดูแลอย่างเคร่งครัดไม่ให้มีการขายสินค้าตัดราคา
        หากเกิดความเสียหายจากการขายสินค้าตัดราคาโดยการกระทำของบุคคลดังกล่าวในข้อ 16.5
        หรือของบุคคลอื่นใดที่เกี่ยวข้องกับสินค้าของบริษัทที่ตัวแทนจำหน่ายได้ซื้อหรือรับไป ไม่ว่าในกรณีใด ๆ
        ตัวแทนจำหน่ายยินยอมรับผิดชอบต่อบริษัททั้งสิ้น โดยยินยอมให้บริษัทปรับเป็นเงินจำนวน 300,000 บาท (สามแสนบาทถ้วน)
        ต่อครั้งที่ได้มีการฝ่าฝืนสัญญาข้อนี้ หรือต่อครั้งที่ได้มีการขายสินค้าตัดราคาโดยบุคคลดังกล่าวข้างต้น<br/>
        16.7 ตัวแทนจำหน่ายทราบดีว่า การขายสินค้าตัดราคาดังกล่าวจะทำให้บริษัท ตัวแทนจำหน่าย และผู้จัดจำหน่ายคนอื่น ๆ
        ได้รับผลกระทบและความเสียหายทางธุรกิจ ดังนั้น หากตัวแทนจำหน่าย, ผู้จัดจำหน่าย (ลูกทีม), คู่ค้า,
        หรือบุคคลอื่นใดซึ่งซื้อหรือรับสินค้าไปจากตัวแทนจำหน่ายก็ดี รับไปจากผู้จัดจำหน่าย (ลูกทีม) ของตนก็ดี
        หรือรับไปจากบุคคลใดบุคคลหนึ่งสืบทอดต่อ ๆ กันมาก็ดี
        นำสินค้าของบริษัทที่ได้รับหรือซื้อมาจากตัวแทนจำหน่ายหรือจากบุคคลอื่นใด (ดังมีรายละเอียดตามหมายเลขกล่องสินค้า
        หมายเลขบรรจุภัณฑ์ หมายเลข OR CODE หมายเลขลังบรรจุสินค้า หรือหลักฐานการรับสินค้าอื่นใดที่แสดงการได้รับมา)
        นำไปขายตัดราคาหรือนำไปขายต่ออีกในราคาที่ต่ำกว่าราคาที่บริษัทกำหนด ไม่ว่าจะเป็นการขายในรูปแบบ ประเภท วิธีการ
        หรือลักษณะใด ไม่ว่าเป็นการขายปลีกหรือขายส่ง หรือเป็นการขายในช่องทางตลาดใด
        ไม่ว่าเป็นการขายสินค้าออนไลน์ผ่านทางเว็บไซต์หรือโชเซียลมีเดียอื่นใดที่เป็นสื่อกลางการติดต่อซื้อขายสินค้า
        ไม่ว่าการขายต่อนั้นตัวแทนจำหน่ายจะมีส่วนสนับสนุน ยินยอม
        หรือรู้เห็นเป็นใจด้วยกับการขายตัดราคาดังกล่าวหรือไม่ก็ตาม และไม่ว่าการขายตัดราคาดังกล่าวจะเกิดขึ้นในช่วงใด
        หรือทอดใดตอนใด, หากปรากฎว่ามีการขายสินค้าตัดราคาเกิดขึ้น
        ตัวแทนจำหน่ายตกลงจะรับผิดชอบในความเสียหายที่เกิดขึ้นทั้งสิ้น
        โดยยินยอมให้บริษัทดำเนินคดีกับตัวแทนจำหน่ายได้โดยตรงทันทีที่บริษัทพบเห็นการขายสินค้าตัดราคา ไม่จำต้องบอกกล่าว
        ทั้งนี้ โดยไม่มีข้อยกเว้น ไม่ว่าในกรณีใด ๆ รวมทั้งยินยอมให้บริษัทตัดสิทธิและยกเลิกในการได้รับโปรโมชั่น
        คอมมิชชั่น สิทธิท่องเที่ยวหรือรางวัลตอบแทนการขายของตัวแทนจำหน่ายได้ทั้งสิ้น<br/>
        16.8 ตัวแทนจำหน่ายจะต้องแจ้งช่องทางการทำการตลาด การส่งเสริมการขาย การทำโฆษณาประชาสัมพันธ์ของตนให้บริษัททราบ
        และให้สิทธิแก่บริษัทในการเขาไปตรวจสอบความถูกต้องของข้อมูลต่าง ๆ
        ที่ตัวแทนจำหน่ายได้แสดงและหรือสื่อไปยังผู้บริโภคหรือบุคคลอื่นใดได้ทุกเมื่อ
        หากบริษัทเห็นว่าการทำการตลาดและการกระทำดังกล่าวของตัวแทนจำหน่ายเป็นการฝ่าฝืนข้อตกลง
        เป็นการผิดต่อนโยบายและหลักธรรมาภิบาลของบริษัท หรือเป็นการกระทำที่กระทบหรืออาจกระทบต่อชื่อเสียง ภาพลักษณ์
        การประกอบธุรกิจ หรือส่วนได้เสียของบริษัท ตัวแทนจำหน่ายตกลงระบบการกระทำดังกล่าวและจะแก้ไข เปลี่ยนแปลง
        หรือปฏิบัติตามแนวนโยบายหรือข้อกำหนดที่บริษัทแจ้งให้ทราบทุกประการ<br/>
        16.9 เมื่อได้รับความยินยอมจากบริษัทแล้ว
        ตัวแทนจำหน่ายจะส่งเสริมการขายด้วยสื่อส่งเสริมการขายที่บริษัทเป็นผู้จัดทำขึ้นเท่านั้น
        ไม่ว่าจะเป็นสื่อทางอินเทอร์เน็ต วิทยุ โทรทัศน์ โชเชียลมีเดีย ภาพนิ่ง วิดีโอ คลิปวิดีโอ แผนพับ โปรชัวร์
        ตลอดจนสื่อในช่องทางอื่นใด ทั้งนี้ให้เป็นไปตามที่บริษัทเป็นผู้กำหนด<br/>
        16.10 เว้นแต่จะได้รับความยินยอมเป็นหนังสือโดยชัดแจ้งจากบริษัท ตัวแทนจำหน่ายจะไม่ผลิต ขาย ให้ยืม ให้เช่า
        หรือโฆษณาซึ่งผลิตภัณฑ์ สินค้า อุปกรณ์ส่งเสริมการขาย หรือวัสดุสิ่งอื่นใดที่มีชื่อ ชื่อทางการค้า สัญลักษณ์
        เครื่องหมาย ดวงตรา รูปรอย หรือเครื่องการค้าของบริษัท กรรมการหรือผู้บริหารของบริษัทปรากฏอยู่
        รวมทั้งสิ่งอื่นใดจนทำให้หรืออาจทำให้สาธารณชนสับสนหรือหลงเชื่อว่าเป็นการดำเนินการโดยบริษัทหรือกรรมการ
        หรือเป็นการที่บริษัท กรรมการหรือผู้บริหาร ได้รู้เห็น รับรอง อนุญาตหรือให้ความยินยอมแล้ว ทั้งนี้
        ไม่ว่าทั้งหมดหรือแต่บางส่วน<br/>
        16.11 บริษัทไม่อนุญาตและไม่ยินยอมให้คู่ค้าหรือตัวแทนของตัวแทนจำหน่าย หรือบุคคลใดใช้ชื่อ ชื่อทางการค้า สัญลักษณ์
        เครื่องหมาย ดวงตรา รูปรอย หรือเครื่องการค้า ของบริษัท
        กรรมการหรือผู้บริหารของบริษัทไปดำเนินการอย่างหนึ่งอย่างใดจนทำให้หรืออาจทำให้สาธารณชนสับสนหรือหลงเชื่อว่าเป็นการดำเนินการโดยบริษัทหรือกรรมการ
        หรือเป็นการที่บริษัทกรรมการ หรือผู้บริหารได้รู้เห็น รับรอง อนุญาตหรือให้ความยินยอมแล้ว ทั้งนี้
        ไม่ว่าทั้งหมดหรือแต่บางส่วน เว้นแต่จะได้รับความยินยอมเป็นหนังสือโดยชัดแจ้งจากบริษัทเท่านั้น<br/>
        16.12 ตัวแทนจำหน่ายจะไม่กระทำการใด ๆ อันเป็นการเปลี่ยนแปลง ดัดแปลง แก้ไข เพิ่มเติม ซึ่งรูปแบบ รูปลักษณ์ ฉลาก
        ข้อความ คำโฆษณา สรรพคุณ วิธีใช้ รายละเอียด ขนาด
        ปริมาณและจำนวนของสินค้าให้ผิดแผกแตกต่างหรือเปลี่ยนแปลงไปจากที่บริษัทได้ทำขึ้น ไม่ว่าแต่ส่วนหนึ่งส่วนใด
        และจะไม่นำสินค้าอันเกิดจากการกระทำในลักษณะดังกล่าวไปจำหน่ายต่อให้แก่บุคคลใด ๆ ทั้งสิ้นในการปฏิบัติตามสัญญานิ
        ตัวแทนจำหน่ายจะไม่ทำการแสวงผลประโยชน์ในทางมิชอบจากตัวแทนจำหน่ายด้วยกัน
        หรือร่วมกับตัวแทนจำหน่ายคนอื่นกระทำการขายสินค้าตัดราคา จัดโปรโมชั่น
        หรือกระทำการอื่นใดที่ก่อให้เกิดผลกระทบหรือเกิดความเสียหายต่อบริษัท<br/>
        16.13
        ตัวแทนจำหน่ายจะไม่นำสินค้าของบริษัทไปทำธุรกิจหรือไปดำเนินการในทางอื่นใดที่ผิดกฎหมายหรือขัดต่อความสบเรียบร้อยหรือศีลธรรมอันดีของประชาชน
        หรือที่เป็นการผิดวัตถุประสงค์หรือนโยบายของบริษัทจนสงผลเสียหายต่อบริษัท<br/>
        16.14 ตัวแทนจำหน่ายจะไม่แอบอ้าง ไม่ใช้ชื่อ ชื่อทางการค้า สัญลักษณ์ เครื่องหมาย ดวงตรา รูปรอย รูปภาพ คำ ข้อความ
        หรือเครื่องการค้าของบริษัท (ไม่ว่าจะได้จดทะเบียนหรือไม่ก็ตาม) ของกรรมการ
        หรือผู้บริหารของบริษัทไปดำเนินการอย่างหนึ่งอย่างใดที่ผิดกฎหมายหรือขัดต่อความสงบเรียบร้อยหรือศีลธรรมอันดีของประชาชน
        หรือที่เป็นการผิดวัตถุประสงค์หรือนโยบายของบริษัทจนส่งผลเสียหายตอบริษัท
        จนทำให้หรืออาจทำให้สาธารณชนสับสนหรือหลงเชื่อว่าเป็นการดำเนินการโดยบริษัทหรือกรรมการ หรือเป็นการที่บริษัท กรรมการ
        หรือผู้บริหาร ได้รู้เห็น รับรอง อนุญาตหรือให้ความยินยอมแล้ว ทั้งนี้ ไม่ว่าทั้งหมดหรือแต่บางส่วน<br/>
        16.15 ตัวแทนจำหน่ายจะจำหน่าย จ่าย โอนสิทธิ (ขายสิทธิ)
        หรือนำสิทธิการเป็นตัวแทนจำหน่ายตามสัญญานี้ไปให้บุคคลอื่นเป็นตัวแทนจำหน่ายแทน หรือเป็นผู้รับสัญญาช่วง
        หรือเข้าดำเนินกิจการช่วงแทนตัวแทนจำหน่ายมิได้ ไม่ว่าทั้งหมดหรือแต่บางส่วน
        เว้นแต่จะได้รับความยินยอมเป็นหนังสือโดยชัดแจ้งจากบริษัทแล้ว<br/>
        16.16 ตัวแทนจำหน่ายมีสิทธิตั้งผู้จัดจำหน่ายของตนได้
        และผู้จัดจำหน่ายของตัวแทนจำหน่ายนั้นจะต้องปฏิบัติตามนโยบายและหลักธรรมาภิบาลของบริษัทที่ได้ระบุไว้ในสัญญาฉบับนี้หรือที่บริษัทได้กำหนดทุกประการ<br/>
        16.17
        ตัวแทนจำหน่ายจะต้องแจ้งให้ผู้จัดจำหน่ายทราบรายละเอียดของราคาสินค้าที่บริษัทกำหนดให้ขายในวันทำสัญญากับผู้จัดจำหน่าย
        จะต้องควบคุมและดูแลผู้จัดจำหน่ายของตนโดยใช้ความระมัดระวังในระดับที่เหมาะสมมากกว่าระดับของวิญญูชน
        มิให้กระทำการฝ่าฝืนนโยบาย จรรยาบรรณ และหลักธรรมาภิบาลของบริษัท หรือกระทำให้เกิดความเสียหายต่อบริษัท
        หรือต่อตัวแทนจำหน่ายคนอื่น ๆ หากผู้จัดจำหน่ายหรือคู่ค้าของตัวแทนจำหน่ายทำให้เกิดความเสียหายต่อบริษัท
        ไม่ว่าจะเป็นการขายสินค้าตัดราคา หรือกระทำการอื่นใดในทางเสียหายต่อบริษัท
        บริษัทมีสิทธิบอกเลิกสัญญาและเรียกค่าเสียหายจากตัวแทนจำหน่ายได้ทันที<br/>
        16.18 หากผู้จัดจำหน่าย ลูกทีม ตัวแทน หรือคู่ค้าของตัวแทนจำหน่ายทำให้เกิดความเสียหายต่อบริษัท
        ไม่ว่าจะเป็นการขายสินค้าตัดราคา หรือกระทำการอื่นใดในทางที่เสียหายต่อบริษัท
        และบริษัทได้แจ้งเหตุดังกล่าวให้ตัวแทนจำหน่ายทราบแล้ว
        ตัวแทนจำหน่ายจะจัดการแก้ไขปัญหาที่เกิดขึ้นให้เรียบร้อยหรือจัดการในทางใดทางหนึ่งไม่ให้บริษัทต้องเสียหาย
        โดยจะดำเนินการแก้ไขปัญหาการขายสินค้าตัดราคาหรือปัญหาอื่นใดที่เกิดขึ้นให้เสร็จสิ้นภายในกำหนด 7 (เจ็ด) วัน
        และรายงานผลการจัดการหรือการแก้ไขปัญหาดังกล่าวให้บริษัททราบโดยเร็ว หากตัวแทนจำหน่ายเพิกเฉย
        ไม่แก้ไขปัญหาการตัดราคา หรือแก้ไขปัญหาการตัดราคาไม่สำเร็จ ขัดขืน
        หรือไม่ยอมใช้สิทธิเรียกร้องในการจัดการหรือดำเนินการตามกฎหมายกับผู้จัดจำหน่าย
        หอคู่ค้าของตัวแทนจำหน่ายที่ทำความเสียหายให้กับบริษัท เป็นเหตุให้บริษัทต้องเสียประโยชน์ก็ดี
        ตัวแทนจำหน่ายยินยอมให้บริษัทใช้สิทธิเรียกร้องในนามของบริษัทดำเนินคดีกับผู้จัดจำหน่ายหรือคู่ค้าของตัวแทนจำหน่ายแทนตัวแทนจำหน่ายได้ทุกประการ
        โดยให้ถือเอาข้อตกลงส่วนนี้เป็นการให้ความยินยอมล่วงหน้า<br/>
        16.19 ตัวแทนจำหน่ายจะปฏิบัติตามประกาศ ระเบียบ
        และข้อกำหนดของบริษัทเกี่ยวกับการเป็นตัวแทนจำหน่ายและที่เกี่ยวกับสินค้าและการจำหน่ายสินค้า ทั้งนี้
        ตามที่ได้เผยแพร่หรือประกาศลงในเว็บไซต์ของบริษัท หรือตามที่ได้แจ้งให้ตัวแทนจำหน่ายทราบในช่องทางอื่นใด<br/>
    </div>
    17. ข้อตกลงและเงื่อนไขในสัญญาดังกล่าวมาทั้งหมดนี้ ถือเป็นสาระสำคัญหมดทุกข้อ การเลิกสัญญาให้เป็นไปดังนี้
    <div class="spacetab">
        17.1 หากคู่สัญญาฝ่ายใดฝ่ายหนึ่งประพฤติผิดสัญญาข้อหนึ่งข้อใด อีกฝ่ายหนึ่งมีอำนาจบอกเลิกสัญญาได้ทันที
        โดยต้องบอกเลิกสัญญาเป็นหนังสือลงลายมือชื่อผู้บอกเลิกสัญญาเป็นสำคัญ<br/>
        17.2 หากบริษัทเป็นฝ่ายเลิกสัญญา ตัวแทนจำหน่ายตกลงให้บริษัทระงับและยกเลิกการให้รางวัลคอมมิชชั่น สิทธิท่องเที่ยว
        ทรัพย์สิน หรือผลประโยชน์อื่นใดอันเนื่องจากการจำหน่ายสินค้าหรือจากการเป็นตัวแทนจำหน่ายตามสัญญาได้ทันที
        ไม่ว่าสิทธิประโยชน์ดังกล่าวจะเกิดขึ้นในช่วงเวลาใดก็ตาม<br/>
        17.3 หากตัวแทนจำหน่ายผิดสัญญาข้อหนึ่งขอให้
        และการผิดสัญญาดังกล่าวเกิดจากความจงใจที่จะทำให้บริษัทเสียหายหรือเล็งเห็นได้ว่าจะทำให้บริษัทได้รับความเสียหาย
        ตัวแทนจำหน่าย ยินยอมรับผิดต่อบริษัทและผู้ที่ได้รับความเสียหายตามความเสียหายที่เกิดขึ้นทั้งสิ้น
        และยินยอมเสียเบี้ยปรับให้แก่บริษัทเป็นเงินจำนวน 300,000 บาท ต่อการผิดสัญญาแต่ละข้อหรือแต่ละครั้ง
        แล้วแต่กรณี<br/>
        17.4 กรณีที่ฝ่ายใดฝ่ายหนึ่งถูกฟ้องเป็นคดีล้มละลาย หรือถูกยึดหรืออายัดทรัพย์สิน
        หรือตกเป็นผู้ไร้ความสามารถตามกฎหมาย
        หรือมีเหตุอันสมควรอื่นใดที่เห็นได้ว่าอีกฝ่ายหนึ่งนั้นไม่สามารถจะปฏิบัติตามสัญญาได้ต่อไปโดยสิ้นเชิง
        อีกฝ่ายหนึ่งบอกเลิกสัญญาได้<br/>
        17.5 หากฝ่ายใดประพฤติผิดสัญญาข้อใดข้อหนึ่ง และอีกฝ่ายหนึ่งเห็นว่าอาจแก้ไขหรือจัดการให้ถูกต้องได้
        เมื่ออีกฝ่ายได้แจ้งให้ฝ่ายที่ผิดสัญญาแก้ไขหรือจัดการแล้ว ฝ่ายที่ผิดสัญญาไม่ดำเนินการตามเวลาที่กำหนด
        อีกฝ่ายหนึ่งมีสิทธิบอกเลิกสัญญาได้ทันที
        และมิให้ถือว่าการให้โอกาสแก้ไขหรือจัดการดังกล่าวเป็นการให้สัตยาบันหรือสละสิทธิการบอกเลิกสัญญา<br/>
        17.6 ในกรณีผิดสัญญาและเรียกค่าเสียหายนั้น
        ฝ่ายที่ผิดสัญญายินยอมชดใช้ค่าเสียหายและดอกเบี้ยให้แก่อีกฝ่ายหนึ่งในอัตราร้อยละ 15 ต่อปี
        ของจำนวนค่าเสียหายที่เกิดขึ้นจริง<br/>
        17.7 หากมีข้อพิพาทเกิดขึ้นจากการประพฤติผิดสัญญานี้ ฝ่ายที่ผิดสัญญายอมรับผิดต่ออีกฝ่ายหนึ่งที่มิได้ผิดสัญญา
        โดยรับผิดชอบสำหรับค่าใช้จ่ายในการดำเนินคดี อันได้แก่ ค่าบอกกล่าวทวงถามค่าที่ปรึกษากฎหมาย
        ค่าฤชาธรรมเนียมในการฟ้องร้องดำเนินคดี ค่าธรรมเนียมในการบังคับคดี
        รวมทั้งค่าใช้จ่ายและค่าทนายความที่เกิดขึ้นจากการเรียกร้องหรือดำเนินคดีให้แก่อีกฝ่ายหนึ่งทุกประการ
        พร้อมดอกเบี้ยในอัตราร้อยละ 7.5 ต่อปี ของต้นเงินจำนวนดังกล่าว<br/>
    </div>
    18. การแสดงเจตนา บอกกล่าว ประกาศ ชี้แจง แจ้งให้ทราบ หรือทวงถามใด ๆ อันคู่สัญญาส่งถึงกันนั้น
    หากได้ส่งตามภูมิลำเนาของคู่สัญญาฝ่ายผู้รับตามที่ปรากฎในสัญญาหรือตามภูมิลำเนาอันแท้จริงแล้วก็ดี
    ได้ส่งทางสื่อโซเชียลมีเตียไปยังบัญชีผู้ใช้ของผู้รับแล้วก็ดี ให้ถือว่าเป็นการส่งโดยชอบ
    และคู่สัญญาฝ่ายผู้รับได้ทราบความดังกล่าวนั้นแล้ว<br/><br/><br/>
    </p>
    <h5>
        <div class="form-check text-center">
            <label class="form-check-label">
                <input type="checkbox" class="form-check-input" onclick="goto_register();">
                "ข้าพเจ้าขอยอมรับเงื่อนไขดังระบุมาข้างต้นทั้งหมดและตกลงทำสัญญานี้"
            </label>
            <div style="margin-top: 2%">
                <button class="btn btn-background" onclick="confirmregis();">ยอมรับเงื่อนไข</button>
            </div>
        </div>
    </h5>

</div>
<input type="hidden" id="status">
<script>
    $(document).ready(function () {
        $('#status').val('false');
    });
    function goto_register() {
        if( $('#status').val() == 'true'){
            $('#status').val('false');
        }else{
            $('#status').val('true');
        }


    }
    function confirmregis() {
        if($('#status').val() == 'false'){
            alert('กรุณากดยอมรับเงื่อนไขเพื่อทำรายการต่อไป');
        }else{
            location.href = "<?=site_url($this->uri->segment(1).'/register')?>";
        }
    }
</script>
